In [1]:
import pandas as pd

In [2]:
df2015 = pd.read_csv("uber-raw-data-janjune-15.csv")

In [3]:
df2015.head()

  Dispatching_base_num          Pickup_date Affiliated_base_num  locationID
0               B02617  2015-05-17 09:47:00              B02617         141
1               B02617  2015-05-17 09:47:00              B02617          65
2               B02617  2015-05-17 09:47:00              B02617         100
3               B02617  2015-05-17 09:47:00              B02774          80
4               B02617  2015-05-17 09:47:00              B02617          90

In [4]:
df2015.shape

(14270479, 4)

In [5]:
df2015.info(null_counts=True)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14270479 entries, 0 to 14270478
Data columns (total 4 columns):
 #   Column                Non-Null Count     Dtype
---  ------                --------------     -----
 0   Dispatching_base_num  14270479 non-null  object
 1   Pickup_date           14270479 non-null  object
 2   Affiliated_base_num   14108284 non-null  object
 3   locationID            14270479 non-null  int64
dtypes: int64(1), object(3)
memory usage: 435.5+ MB

In [6]:
df2015.head(10)

  Dispatching_base_num          Pickup_date Affiliated_base_num  locationID
0               B02617  2015-05-17 09:47:00              B02617         141
1               B02617  2015-05-17 09:47:00              B02617          65
2               B02617  2015-05-17 09:47:00              B02617         100
3               B02617  2015-05-17 09:47:00              B02774          80
4               B02617  2015-05-17 09:47:00              B02617          90
5               B02617  2015-05-17 09:47:00              B02617         228
6               B02617  2015-05-17 09:47:00              B02617           7
7               B02617  2015-05-17 09:47:00              B02764          74
8               B02617  2015-05-17 09:47:00              B02617         249
9               B02617  2015-05-17 09:47:00              B02764          22